package com.shankara.venki.narayana;

import android.graphics.Typeface;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.text.method.ScrollingMovementMethod;
import android.widget.TextView;

public class Annapurna extends AppCompatActivity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main);

        TextView tvKannada = (TextView) findViewById(R.id.tvKannada);
        tvKannada.setMovementMethod(new ScrollingMovementMethod());


        Typeface faceAkshar = Typeface.createFromAsset(getAssets(),
                "akshar.ttf");

        tvKannada.setTypeface(faceAkshar);

        tvKannada.setText("ನಿತ್ಯಾನಂದಕರೀ ವರಾಭಯಕರೀ ಸೌಂದರ್ಯ ರತ್ನಾಕರೀ\n" +
                "ನಿರ್ಧೂತಾಖಿಲ ಘೋರ ಪಾವನಕರೀ ಪ್ರತ್ಯಕ್ಷ ಮಾಹೇಶ್ವರೀ |\n" +
                "ಪ್ರಾಲೇಯಾಚಲ ವಂಶ ಪಾವನಕರೀ ಕಾಶೀಪುರಾಧೀಶ್ವರೀ\n" +
                "ಭಿಕ್ಷಾಂ ದೇಹಿ ಕೃಪಾವಲಂಬನಕರೀ ಮಾತಾನ್ನಪೂರ್ಣೇಶ್ವರೀ || 1 ||\n" +
                "ನಾನಾ ರತ್ನ ವಿಚಿತ್ರ ಭೂಷಣಕರಿ ಹೇಮಾಂಬರಾಡಂಬರೀ\n" +
                "ಮುಕ್ತಾಹಾರ ವಿಲಂಬಮಾನ ವಿಲಸತ್-ವಕ್ಷೋಜ ಕುಂಭಾಂತರೀ |\n" +
                "ಕಾಶ್ಮೀರಾಗರು ವಾಸಿತಾ ರುಚಿಕರೀ ಕಾಶೀಪುರಾಧೀಶ್ವರೀ\n" +
                "ಭಿಕ್ಷಾಂ ದೇಹಿ ಕೃಪಾವಲಂಬನಕರೀ ಮಾತಾನ್ನಪೂರ್ಣೇಶ್ವರೀ || 2 ||\n" +
                "ಯೋಗಾನಂದಕರೀ ರಿಪುಕ್ಷಯಕರೀ ಧರ್ಮೈಕ್ಯ ನಿಷ್ಠಾಕರೀ\n" +
                "ಚಂದ್ರಾರ್ಕಾನಲ ಭಾಸಮಾನ ಲಹರೀ ತ್ರೈಲೋಕ್ಯ ರಕ್ಷಾಕರೀ |\n" +
                "ಸರ್ವೈಶ್ವರ್ಯಕರೀ ತಪಃ ಫಲಕರೀ ಕಾಶೀಪುರಾಧೀಶ್ವರೀ\n" +
                "ಭಿಕ್ಷಾಂ ದೇಹಿ ಕೃಪಾವಲಂಬನಕರೀ ಮಾತಾನ್ನಪೂರ್ಣೇಶ್ವರೀ || 3 ||\n" +
                "ಕೈಲಾಸಾಚಲ ಕಂದರಾಲಯಕರೀ ಗೌರೀ-ಹ್ಯುಮಾಶಾಂಕರೀ \n" +
                "ಕೌಮಾರೀ ನಿಗಮಾರ್ಥ-ಗೋಚರಕರೀ-ಹ್ಯೋಂಕಾರ-ಬೀಜಾಕ್ಷರೀ |\n" +
                "ಮೋಕ್ಷದ್ವಾರ-ಕವಾಟಪಾಟನಕರೀ ಕಾಶೀಪುರಾಧೀಶ್ವರೀ \n" +
                "ಭಿಕ್ಷಾಂ ದೇಹಿ ಕೃಪಾವಲಂಬನಕರೀ ಮಾತಾನ್ನಪೂರ್ಣೇಶ್ವರೀ || 4 ||\n" +
                "ದೃಶ್ಯಾದೃಶ್ಯ-ವಿಭೂತಿ-ವಾಹನಕರೀ ಬ್ರಹ್ಮಾಂಡ-ಭಾಂಡೋದರೀ \n" +
                "ಲೀಲಾ-ನಾಟಕ-ಸೂತ್ರ-ಖೇಲನಕರೀ ವಿಙ್ಞಾನ-ದೀಪಾಂಕುರೀ |\n" +
                "ಶ್ರೀವಿಶ್ವೇಶಮನಃ-ಪ್ರಸಾದನಕರೀ ಕಾಶೀಪುರಾಧೀಶ್ವರೀ \n" +
                "ಭಿಕ್ಷಾಂ ದೇಹಿ ಕೃಪಾವಲಂಬನಕರೀ ಮಾತಾನ್ನಪೂರ್ಣೇಶ್ವರೀ || 5 ||\n" +
                "ಉರ್ವೀಸರ್ವಜಯೇಶ್ವರೀ ಜಯಕರೀ ಮಾತಾ ಕೃಪಾಸಾಗರೀ \n" +
                "ವೇಣೀ-ನೀಲಸಮಾನ-ಕುಂತಲಧರೀ ನಿತ್ಯಾನ್ನ-ದಾನೇಶ್ವರೀ |\n" +
                "ಸಾಕ್ಷಾನ್ಮೋಕ್ಷಕರೀ ಸದಾ ಶುಭಕರೀ ಕಾಶೀಪುರಾಧೀಶ್ವರೀ \n" +
                "ಭಿಕ್ಷಾಂ ದೇಹಿ ಕೃಪಾವಲಂಬನಕರೀ ಮಾತಾನ್ನಪೂರ್ಣೇಶ್ವರೀ || 6 ||\n" +
                "ಆದಿಕ್ಷಾಂತ-ಸಮಸ್ತವರ್ಣನಕರೀ ಶಂಭೋಸ್ತ್ರಿಭಾವಾಕರೀ \n" +
                "ಕಾಶ್ಮೀರಾ ತ್ರಿಪುರೇಶ್ವರೀ ತ್ರಿನಯನಿ ವಿಶ್ವೇಶ್ವರೀ ಶರ್ವರೀ |\n" +
                "ಸ್ವರ್ಗದ್ವಾರ-ಕಪಾಟ-ಪಾಟನಕರೀ ಕಾಶೀಪುರಾಧೀಶ್ವರೀ \n" +
                "ಭಿಕ್ಷಾಂ ದೇಹಿ ಕೃಪಾವಲಂಬನಕರೀ ಮಾತಾನ್ನಪೂರ್ಣೇಶ್ವರೀ || 7 ||\n" +
                "ದೇವೀ ಸರ್ವವಿಚಿತ್ರ-ರತ್ನರುಚಿತಾ ದಾಕ್ಷಾಯಿಣೀ ಸುಂದರೀ \n" +
                "ವಾಮಾ-ಸ್ವಾದುಪಯೋಧರಾ ಪ್ರಿಯಕರೀ ಸೌಭಾಗ್ಯಮಾಹೇಶ್ವರೀ |\n" +
                "ಭಕ್ತಾಭೀಷ್ಟಕರೀ ಸದಾ ಶುಭಕರೀ ಕಾಶೀಪುರಾಧೀಶ್ವರೀ \n" +
                "ಭಿಕ್ಷಾಂ ದೇಹಿ ಕೃಪಾವಲಂಬನಕರೀ ಮಾತಾನ್ನಪೂರ್ಣೇಶ್ವರೀ || 8 ||\n" +
                "ಚಂದ್ರಾರ್ಕಾನಲ-ಕೋಟಿಕೋಟಿ-ಸದೃಶೀ ಚಂದ್ರಾಂಶು-ಬಿಂಬಾಧರೀ \n" +
                "ಚಂದ್ರಾರ್ಕಾಗ್ನಿ-ಸಮಾನ-ಕುಂಡಲ-ಧರೀ ಚಂದ್ರಾರ್ಕ-ವರ್ಣೇಶ್ವರೀ \n" +
                "ಮಾಲಾ-ಪುಸ್ತಕ-ಪಾಶಸಾಂಕುಶಧರೀ ಕಾಶೀಪುರಾಧೀಶ್ವರೀ \n" +
                "ಭಿಕ್ಷಾಂ ದೇಹಿ ಕೃಪಾವಲಂಬನಕರೀ ಮಾತಾನ್ನಪೂರ್ಣೇಶ್ವರೀ || 9 ||\n" +
                "ಕ್ಷತ್ರತ್ರಾಣಕರೀ ಮಹಾಭಯಕರೀ ಮಾತಾ ಕೃಪಾಸಾಗರೀ \n" +
                "ಸರ್ವಾನಂದಕರೀ ಸದಾ ಶಿವಕರೀ ವಿಶ್ವೇಶ್ವರೀ ಶ್ರೀಧರೀ |\n" +
                "ದಕ್ಷಾಕ್ರಂದಕರೀ ನಿರಾಮಯಕರೀ ಕಾಶೀಪುರಾಧೀಶ್ವರೀ \n" +
                "ಭಿಕ್ಷಾಂ ದೇಹಿ ಕೃಪಾವಲಂಬನಕರೀ ಮಾತಾನ್ನಪೂರ್ಣೇಶ್ವರೀ || 10 ||\n" +
                "ಅನ್ನಪೂರ್ಣೇ ಸಾದಾಪೂರ್ಣೇ ಶಂಕರ-ಪ್ರಾಣವಲ್ಲಭೇ |\n" +
                "ಙ್ಞಾನ-ವೈರಾಗ್ಯ-ಸಿದ್ಧಯರ್ಥಂ ಬಿಕ್ಬಿಂ ದೇಹಿ ಚ ಪಾರ್ವತೀ || 11 ||\n" +
                "ಮಾತಾ ಚ ಪಾರ್ವತೀದೇವೀ ಪಿತಾದೇವೋ ಮಹೇಶ್ವರಃ |\n" +
                "ಬಾಂಧವಾ: ಶಿವಭಕ್ತಾಶ್ಚ ಸ್ವದೇಶೋ ಭುವನತ್ರಯಮ್ || 12 ||\n" +
                "ಸರ್ವ-ಮಂಗಲ-ಮಾಂಗಲ್ಯೇ ಶಿವೇ ಸರ್ವಾರ್ಥ-ಸಾಧಿಕೇ |\n" +
                "ಶರಣ್ಯೇ ತ್ರ್ಯಂಬಕೇ ಗೌರಿ ನಾರಾಯಣಿ ನಮೋ\uFEFF\u200Cஉಸ್ತು ತೇ || 13 ||");
    }
}
