package com.shankara.venki.narayana;

import android.graphics.Typeface;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.text.method.ScrollingMovementMethod;
import android.widget.TextView;

public class Govinda extends AppCompatActivity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main);

        TextView tvKannada = (TextView) findViewById(R.id.tvKannada);
        tvKannada.setMovementMethod(new ScrollingMovementMethod());


        Typeface faceAkshar = Typeface.createFromAsset(getAssets(),
                "akshar.ttf");

        tvKannada.setTypeface(faceAkshar);

        tvKannada.setText("ಸತ್ಯಂ ಙ್ಞಾನಮನಂತಂ ನಿತ್ಯಮನಾಕಾಶಂ ಪರಮಾಕಾಶಮ್ |\n" +
                "ಗೋಷ್ಠಪ್ರಾಂಗಣರಿಂಖಣಲೋಲಮನಾಯಾಸಂ ಪರಮಾಯಾಸಮ್ |\n" +
                "ಮಾಯಾಕಲ್ಪಿತನಾನಾಕಾರಮನಾಕಾರಂ ಭುವನಾಕಾರಮ್ |\n" +
                "ಕ್ಷ್ಮಾಮಾನಾಥಮನಾಥಂ ಪ್ರಣಮತ ಗೋವಿಂದಂ ಪರಮಾನಂದಮ್ || 1 ||\n" +
                "ಮೃತ್ಸ್ನಾಮತ್ಸೀಹೇತಿ ಯಶೋದಾತಾಡನಶೈಶವ ಸಂತ್ರಾಸಮ್ |\n" +
                "ವ್ಯಾದಿತವಕ್ತ್ರಾಲೋಕಿತಲೋಕಾಲೋಕಚತುರ್ದಶಲೋಕಾಲಿಮ್ |\n" +
                "ಲೋಕತ್ರಯಪುರಮೂಲಸ್ತಂಭಂ ಲೋಕಾಲೋಕಮನಾಲೋಕಮ್ |\n" +
                "ಲೋಕೇಶಂ ಪರಮೇಶಂ ಪ್ರಣಮತ ಗೋವಿಂದಂ ಪರಮಾನಂದಮ್ || 2 ||\n" +
                "ತ್ರೈವಿಷ್ಟಪರಿಪುವೀರಘ್ನಂ ಕ್ಷಿತಿಭಾರಘ್ನಂ ಭವರೋಗಘ್ನಮ್ |\n" +
                "ಕೈವಲ್ಯಂ ನವನೀತಾಹಾರಮನಾಹಾರಂ ಭುವನಾಹಾರಮ್ |\n" +
                "ವೈಮಲ್ಯಸ್ಫುಟಚೇತೋವೃತ್ತಿವಿಶೇಷಾಭಾಸಮನಾಭಾಸಮ್ |\n" +
                "ಶೈವಂ ಕೇವಲಶಾಂತಂ ಪ್ರಣಮತ ಗೋವಿಂದಂ ಪರಮಾನಂದಮ್ || 3 ||\n" +
                "ಗೋಪಾಲಂ ಪ್ರಭುಲೀಲಾವಿಗ್ರಹಗೋಪಾಲಂ ಕುಲಗೋಪಾಲಮ್ |\n" +
                "ಗೋಪೀಖೇಲನಗೋವರ್ಧನಧೃತಿಲೀಲಾಲಾಲಿತಗೋಪಾಲಮ್ |\n" +
                "ಗೋಭಿರ್ನಿಗದಿತ ಗೋವಿಂದಸ್ಫುಟನಾಮಾನಂ ಬಹುನಾಮಾನಮ್ |\n" +
                "ಗೋಪೀಗೋಚರದೂರಂ ಪ್ರಣಮತ ಗೋವಿಂದಂ ಪರಮಾನಂದಮ್ || 4 ||\n" +
                "ಗೋಪೀಮಂಡಲಗೋಷ್ಠೀಭೇದಂ ಭೇದಾವಸ್ಥಮಭೇದಾಭಮ್ |\n" +
                "ಶಶ್ವದ್ಗೋಖುರನಿರ್ಧೂತೋದ್ಗತ ಧೂಳೀಧೂಸರಸೌಭಾಗ್ಯಮ್ |\n" +
                "ಶ್ರದ್ಧಾಭಕ್ತಿಗೃಹೀತಾನಂದಮಚಿಂತ್ಯಂ ಚಿಂತಿತಸದ್ಭಾವಮ್ |\n" +
                "ಚಿಂತಾಮಣಿಮಹಿಮಾನಂ ಪ್ರಣಮತ ಗೋವಿಂದಂ ಪರಮಾನಂದಮ್ || 5 ||\n" +
                "ಸ್ನಾನವ್ಯಾಕುಲಯೋಷಿದ್ವಸ್ತ್ರಮುಪಾದಾಯಾಗಮುಪಾರೂಢಮ್ |\n" +
                "ವ್ಯಾದಿತ್ಸಂತೀರಥ ದಿಗ್ವಸ್ತ್ರಾ ದಾತುಮುಪಾಕರ್ಷಂತಂ ತಾಃ\n" +
                "ನಿರ್ಧೂತದ್ವಯಶೋಕವಿಮೋಹಂ ಬುದ್ಧಂ ಬುದ್ಧೇರಂತಸ್ಥಮ್ |\n" +
                "ಸತ್ತಾಮಾತ್ರಶರೀರಂ ಪ್ರಣಮತ ಗೋವಿಂದಂ ಪರಮಾನಂದಮ್ || 6 ||\n" +
                "ಕಾಂತಂ ಕಾರಣಕಾರಣಮಾದಿಮನಾದಿಂ ಕಾಲಧನಾಭಾಸಮ್ |\n" +
                "ಕಾಳಿಂದೀಗತಕಾಲಿಯಶಿರಸಿ ಸುನೃತ್ಯಂತಮ್ ಮುಹುರತ್ಯಂತಮ್ |\n" +
                "ಕಾಲಂ ಕಾಲಕಲಾತೀತಂ ಕಲಿತಾಶೇಷಂ ಕಲಿದೋಷಘ್ನಮ್ |\n" +
                "ಕಾಲತ್ರಯಗತಿಹೇತುಂ ಪ್ರಣಮತ ಗೋವಿಂದಂ ಪರಮಾನಂದಮ್ || 7 ||\n" +
                "ಬೃಂದಾವನಭುವಿ ಬೃಂದಾರಕಗಣಬೃಂದಾರಾಧಿತವಂದೇಹಮ್ |\n" +
                "ಕುಂದಾಭಾಮಲಮಂದಸ್ಮೇರಸುಧಾನಂದಂ ಸುಹೃದಾನಂದಮ್ |\n" +
                "ವಂದ್ಯಾಶೇಷ ಮಹಾಮುನಿ ಮಾನಸ ವಂದ್ಯಾನಂದಪದದ್ವಂದ್ವಮ್ |\n" +
                "ವಂದ್ಯಾಶೇಷಗುಣಾಬ್ಧಿಂ ಪ್ರಣಮತ ಗೋವಿಂದಂ ಪರಮಾನಂದಮ್ || 8 ||\n" +
                "ಗೋವಿಂದಾಷ್ಟಕಮೇತದಧೀತೇ ಗೋವಿಂದಾರ್ಪಿತಚೇತಾ ಯಃ |\n" +
                "ಗೋವಿಂದಾಚ್ಯುತ ಮಾಧವ ವಿಷ್ಣೋ ಗೋಕುಲನಾಯಕ ಕೃಷ್ಣೇತಿ |\n" +
                "ಗೋವಿಂದಾಂಘ್ರಿ ಸರೋಜಧ್ಯಾನಸುಧಾಜಲಧೌತಸಮಸ್ತಾಘಃ |\n" +
                "ಗೋವಿಂದಂ ಪರಮಾನಂದಾಮೃತಮಂತಸ್ಥಂ ಸ ತಮಭ್ಯೇತಿ ||");
    }
}
