package com.shankara.venki.narayana;

import android.graphics.Typeface;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.text.method.ScrollingMovementMethod;
import android.widget.TextView;

public class Jyotir extends AppCompatActivity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main);

        TextView tvKannada = (TextView) findViewById(R.id.tvKannada);
        tvKannada.setMovementMethod(new ScrollingMovementMethod());


        Typeface faceAkshar = Typeface.createFromAsset(getAssets(),
                "akshar.ttf");

        tvKannada.setTypeface(faceAkshar);

        tvKannada.setText("ಸೌರಾಷ್ಟ್ರದೇಶೇ ವಿಶದೇ\uFEFF\u200Cஉತಿರಮ್ಯೇ ಜ್ಯೋತಿರ್ಮಯಂ ಚಂದ್ರಕಳಾವತಂಸಮ್ |\n" +
                "ಭಕ್ತಪ್ರದಾನಾಯ ಕೃಪಾವತೀರ್ಣಂ ತಂ ಸೋಮನಾಥಂ ಶರಣಂ ಪ್ರಪದ್ಯೇ || 1 ||\n" +
                "ಶ್ರೀಶೈಲಶೃಂಗೇ ವಿವಿಧಪ್ರಸಂಗೇ ಶೇಷಾದ್ರಿಶೃಂಗೇ\uFEFF\u200Cஉಪಿ ಸದಾ ವಸಂತಮ್ |\n" +
                "ತಮರ್ಜುನಂ ಮಲ್ಲಿಕಪೂರ್ವಮೇನಂ ನಮಾಮಿ ಸಂಸಾರಸಮುದ್ರಸೇತುಮ್ || 2 ||\n" +
                "ಅವಂತಿಕಾಯಾಂ ವಿಹಿತಾವತಾರಂ ಮುಕ್ತಿಪ್ರದಾನಾಯ ಚ ಸಜ್ಜನಾನಾಮ್ |\n" +
                "ಅಕಾಲಮೃತ್ಯೋಃ ಪರಿರಕ್ಷಣಾರ್ಥಂ ವಂದೇ ಮಹಾಕಾಲಮಹಾಸುರೇಶಮ್ || 3 ||\n" +
                "ಕಾವೇರಿಕಾನರ್ಮದಯೋಃ ಪವಿತ್ರೇ ಸಮಾಗಮೇ ಸಜ್ಜನತಾರಣಾಯ |\n" +
                "ಸದೈವ ಮಾಂಧಾತೃಪುರೇ ವಸಂತಮ್ ಓಂಕಾರಮೀಶಂ ಶಿವಮೇಕಮೀಡೇ || 4 ||\n" +
                "ಪೂರ್ವೋತ್ತರೇ ಪ್ರಜ್ವಲಿಕಾನಿಧಾನೇ ಸದಾ ವಸಂ ತಂ ಗಿರಿಜಾಸಮೇತಮ್ |\n" +
                "ಸುರಾಸುರಾರಾಧಿತಪಾದಪದ್ಮಂ ಶ್ರೀವೈದ್ಯನಾಥಂ ತಮಹಂ ನಮಾಮಿ || 5 ||\n" +
                "ಯಂ ಡಾಕಿನಿಶಾಕಿನಿಕಾಸಮಾಜೇ ನಿಷೇವ್ಯಮಾಣಂ ಪಿಶಿತಾಶನೈಶ್ಚ |\n" +
                "ಸದೈವ ಭೀಮಾದಿಪದಪ್ರಸಿದ್ಧಂ ತಂ ಶಂಕರಂ ಭಕ್ತಹಿತಂ ನಮಾಮಿ || 6 ||\n" +
                "ಶ್ರೀತಾಮ್ರಪರ್ಣೀಜಲರಾಶಿಯೋಗೇ ನಿಬಧ್ಯ ಸೇತುಂ ವಿಶಿಖೈರಸಂಖ್ಯೈಃ |\n" +
                "ಶ್ರೀರಾಮಚಂದ್ರೇಣ ಸಮರ್ಪಿತಂ ತಂ ರಾಮೇಶ್ವರಾಖ್ಯಂ ನಿಯತಂ ನಮಾಮಿ || 7 ||\n" +
                "ಯಾಮ್ಯೇ ಸದಂಗೇ ನಗರೇ\uFEFF\u200Cஉತಿರಮ್ಯೇ ವಿಭೂಷಿತಾಂಗಂ ವಿವಿಧೈಶ್ಚ ಭೋಗೈಃ |\n" +
                "ಸದ್ಭಕ್ತಿಮುಕ್ತಿಪ್ರದಮೀಶಮೇಕಂ ಶ್ರೀನಾಗನಾಥಂ ಶರಣಂ ಪ್ರಪದ್ಯೇ || 8 ||\n" +
                "ಸಾನಂದಮಾನಂದವನೇ ವಸಂತಮ್ ಆನಂದಕಂದಂ ಹತಪಾಪಬೃಂದಮ್ |\n" +
                "ವಾರಾಣಸೀನಾಥಮನಾಥನಾಥಂ ಶ್ರೀವಿಶ್ವನಾಥಂ ಶರಣಂ ಪ್ರಪದ್ಯೇ || 9 ||\n" +
                "ಸಹ್ಯಾದ್ರಿಶೀರ್ಷೇ ವಿಮಲೇ ವಸಂತಂ ಗೋದಾವರಿತೀರಪವಿತ್ರದೇಶೇ |\n" +
                "ಯದ್ದರ್ಶನಾತ್ ಪಾತಕಂ ಪಾಶು ನಾಶಂ ಪ್ರಯಾತಿ ತಂ ತ್ರ್ಯಂಬಕಮೀಶಮೀಡೇ || 10 ||\n" +
                "ಮಹಾದ್ರಿಪಾರ್ಶ್ವೇ ಚ ತಟೇ ರಮಂತಂ ಸಂಪೂಜ್ಯಮಾನಂ ಸತತಂ ಮುನೀಂದ್ರೈಃ |\n" +
                "ಸುರಾಸುರೈರ್ಯಕ್ಷ ಮಹೋರಗಾಢ್ಯೈಃ ಕೇದಾರಮೀಶಂ ಶಿವಮೇಕಮೀಡೇ || 11 ||\n" +
                "ಇಲಾಪುರೇ ರಮ್ಯವಿಶಾಲಕೇ\uFEFF\u200Cஉಸ್ಮಿನ್ ಸಮುಲ್ಲಸಂತಂ ಚ ಜಗದ್ವರೇಣ್ಯಮ್ |\n" +
                "ವಂದೇ ಮಹೋದಾರತರಸ್ವಭಾವಂ ಘೃಷ್ಣೇಶ್ವರಾಖ್ಯಂ ಶರಣಂ ಪ್ರಪದ್ಯೇ || 12 ||\n" +
                "ಜ್ಯೋತಿರ್ಮಯದ್ವಾದಶಲಿಂಗಕಾನಾಂ ಶಿವಾತ್ಮನಾಂ ಪ್ರೋಕ್ತಮಿದಂ ಕ್ರಮೇಣ |\n" +
                "ಸ್ತೋತ್ರಂ ಪಠಿತ್ವಾ ಮನುಜೋ\uFEFF\u200Cஉತಿಭಕ್ತ್ಯಾ ಫಲಂ ತದಾಲೋಕ್ಯ ನಿಜಂ ಭಜೇಚ್ಚ ||");
    }
}
