package com.shankara.venki.narayana;

import android.graphics.Typeface;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.text.method.ScrollingMovementMethod;
import android.widget.TextView;

public class Kanaka extends AppCompatActivity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main);

        TextView tvKannada = (TextView) findViewById(R.id.tvKannada);
        tvKannada.setMovementMethod(new ScrollingMovementMethod());


        Typeface faceAkshar = Typeface.createFromAsset(getAssets(),
                "akshar.ttf");

        tvKannada.setTypeface(faceAkshar);

        tvKannada.setText("ವಂದೇ ವಂದಾರು ಮಂದಾರಮಿಂದಿರಾನಂದ ಕಂದಲಂ\n" +
                "ಅಮಂದಾನಂದ ಸಂದೋಹ ಬಂಧುರಂ ಸಿಂಧುರಾನನಮ್\n" +
                "ಅಂಗಂ ಹರೇಃ ಪುಲಕಭೂಷಣಮಾಶ್ರಯಂತೀ \n" +
                "ಭೃಂಗಾಂಗನೇವ ಮುಕುಳಾಭರಣಂ ತಮಾಲಮ್ |\n" +
                "ಅಂಗೀಕೃತಾಖಿಲ ವಿಭೂತಿರಪಾಂಗಲೀಲಾ \n" +
                "ಮಾಂಗಲ್ಯದಾಸ್ತು ಮಮ ಮಂಗಳದೇವತಾಯಾಃ || 1 ||\n" +
                "ಮುಗ್ಧಾ ಮುಹುರ್ವಿದಧತೀ ವದನೇ ಮುರಾರೇಃ \n" +
                "ಪ್ರೇಮತ್ರಪಾಪ್ರಣಿಹಿತಾನಿ ಗತಾಗತಾನಿ |\n" +
                "ಮಾಲಾದೃಶೋರ್ಮಧುಕರೀವ ಮಹೋತ್ಪಲೇ ಯಾ \n" +
                "ಸಾ ಮೇ ಶ್ರಿಯಂ ದಿಶತು ಸಾಗರ ಸಂಭವಾ ಯಾಃ || 2 ||\n" +
                "ಆಮೀಲಿತಾಕ್ಷಮಧಿಗ್ಯಮ ಮುದಾ ಮುಕುಂದಮ್ \n" +
                "ಆನಂದಕಂದಮನಿಮೇಷಮನಂಗ ತಂತ್ರಮ್ |\n" +
                "ಆಕೇಕರಸ್ಥಿತಕನೀನಿಕಪಕ್ಷ್ಮನೇತ್ರಂ \n" +
                "ಭೂತ್ಯೈ ಭವನ್ಮಮ ಭುಜಂಗ ಶಯಾಂಗನಾ ಯಾಃ || 3 ||\n" +
                "ಬಾಹ್ವಂತರೇ ಮಧುಜಿತಃ ಶ್ರಿತಕೌಸ್ತುಭೇ ಯಾ \n" +
                "ಹಾರಾವಳೀವ ಹರಿನೀಲಮಯೀ ವಿಭಾತಿ |\n" +
                "ಕಾಮಪ್ರದಾ ಭಗವತೋ\uFEFF\u200Cஉಪಿ ಕಟಾಕ್ಷಮಾಲಾ \n" +
                "ಕಳ್ಯಾಣಮಾವಹತು ಮೇ ಕಮಲಾಲಯಾ ಯಾಃ || 4 ||\n" +
                "ಕಾಲಾಂಬುದಾಳಿ ಲಲಿತೋರಸಿ ಕೈಟಭಾರೇಃ \n" +
                "ಧಾರಾಧರೇ ಸ್ಫುರತಿ ಯಾ ತಟಿದಂಗನೇವ |\n" +
                "ಮಾತುಸ್ಸಮಸ್ತಜಗತಾಂ ಮಹನೀಯಮೂರ್ತಿಃ \n" +
                "ಭದ್ರಾಣಿ ಮೇ ದಿಶತು ಭಾರ್ಗವನಂದನಾ ಯಾಃ || 5 ||\n" +
                "ಪ್ರಾಪ್ತಂ ಪದಂ ಪ್ರಥಮತಃ ಖಲು ಯತ್ಪ್ರಭಾವಾತ್ \n" +
                "ಮಾಂಗಲ್ಯಭಾಜಿ ಮಧುಮಾಥಿನಿ ಮನ್ಮಥೇನ |\n" +
                "ಮಯ್ಯಾಪತೇತ್ತದಿಹ ಮಂಥರಮೀಕ್ಷಣಾರ್ಥಂ \n" +
                "ಮಂದಾಲಸಂ ಚ ಮಕರಾಲಯ ಕನ್ಯಕಾ ಯಾಃ || 6 ||\n" +
                "ವಿಶ್ವಾಮರೇಂದ್ರ ಪದ ವಿಭ್ರಮ ದಾನದಕ್ಷಮ್ \n" +
                "ಆನಂದಹೇತುರಧಿಕಂ ಮುರವಿದ್ವಿಷೋ\uFEFF\u200Cஉಪಿ |\n" +
                "ಈಷನ್ನಿಷೀದತು ಮಯಿ ಕ್ಷಣಮೀಕ್ಷಣಾರ್ಥಂ\n" +
                "ಇಂದೀವರೋದರ ಸಹೋದರಮಿಂದಿರಾ ಯಾಃ || 7 ||\n" +
                "ಇಷ್ಟಾ ವಿಶಿಷ್ಟಮತಯೋಪಿ ಯಯಾ ದಯಾರ್ದ್ರ \n" +
                "ದೃಷ್ಟ್ಯಾ ತ್ರಿವಿಷ್ಟಪಪದಂ ಸುಲಭಂ ಲಭಂತೇ |\n" +
                "ದೃಷ್ಟಿಃ ಪ್ರಹೃಷ್ಟ ಕಮಲೋದರ ದೀಪ್ತಿರಿಷ್ಟಾಂ \n" +
                "ಪುಷ್ಟಿಂ ಕೃಷೀಷ್ಟ ಮಮ ಪುಷ್ಕರ ವಿಷ್ಟರಾ ಯಾಃ || 8 ||\n" +
                "ದದ್ಯಾದ್ದಯಾನು ಪವನೋ ದ್ರವಿಣಾಂಬುಧಾರಾಂ\n" +
                "ಅಸ್ಮಿನ್ನಕಿಂಚನ ವಿಹಂಗ ಶಿಶೌ ವಿಷಣ್ಣೇ |\n" +
                "ದುಷ್ಕರ್ಮಘರ್ಮಮಪನೀಯ ಚಿರಾಯ ದೂರಂ \n" +
                "ನಾರಾಯಣ ಪ್ರಣಯಿನೀ ನಯನಾಂಬುವಾಹಃ || 9 ||\n" +
                "ಗೀರ್ದೇವತೇತಿ ಗರುಡಧ್ವಜ ಸುಂದರೀತಿ \n" +
                "ಶಾಕಂಬರೀತಿ ಶಶಿಶೇಖರ ವಲ್ಲಭೇತಿ |\n" +
                "ಸೃಷ್ಟಿ ಸ್ಥಿತಿ ಪ್ರಳಯ ಕೇಳಿಷು ಸಂಸ್ಥಿತಾಯೈ \n" +
                "ತಸ್ಯೈ ನಮಸ್ತ್ರಿಭುವನೈಕ ಗುರೋಸ್ತರುಣ್ಯೈ || 10 ||\n" +
                "ಶ್ರುತ್ಯೈ ನಮೋ\uFEFF\u200Cஉಸ್ತು ಶುಭಕರ್ಮ ಫಲಪ್ರಸೂತ್ಯೈ \n" +
                "ರತ್ಯೈ ನಮೋ\uFEFF\u200Cஉಸ್ತು ರಮಣೀಯ ಗುಣಾರ್ಣವಾಯೈ |\n" +
                "ಶಕ್ತ್ಯೈ ನಮೋ\uFEFF\u200Cஉಸ್ತು ಶತಪತ್ರ ನಿಕೇತನಾಯೈ \n" +
                "ಪುಷ್ಟ್ಯೈ ನಮೋ\uFEFF\u200Cஉಸ್ತು ಪುರುಷೋತ್ತಮ ವಲ್ಲಭಾಯೈ || 11 ||\n" +
                "ನಮೋ\uFEFF\u200Cஉಸ್ತು ನಾಳೀಕ ನಿಭಾನನಾಯೈ \n" +
                "ನಮೋ\uFEFF\u200Cஉಸ್ತು ದುಗ್ಧೋದಧಿ ಜನ್ಮಭೂಮ್ಯೈ |\n" +
                "ನಮೋ\uFEFF\u200Cஉಸ್ತು ಸೋಮಾಮೃತ ಸೋದರಾಯೈ \n" +
                "ನಮೋ\uFEFF\u200Cஉಸ್ತು ನಾರಾಯಣ ವಲ್ಲಭಾಯೈ || 12 ||\n" +
                "ನಮೋ\uFEFF\u200Cஉಸ್ತು ಹೇಮಾಂಬುಜ ಪೀಠಿಕಾಯೈ\n" +
                "ನಮೋ\uFEFF\u200Cஉಸ್ತು ಭೂಮಂಡಲ ನಾಯಿಕಾಯೈ |\n" +
                "ನಮೋ\uFEFF\u200Cஉಸ್ತು ದೇವಾದಿ ದಯಾಪರಾಯೈ\n" +
                "ನಮೋ\uFEFF\u200Cஉಸ್ತು ಶಾರ್ಂಗಾಯುಧ ವಲ್ಲಭಾಯೈ || 13 ||\n" +
                "ನಮೋ\uFEFF\u200Cஉಸ್ತು ದೇವ್ಯೈ ಭೃಗುನಂದನಾಯೈ \n" +
                "ನಮೋ\uFEFF\u200Cஉಸ್ತು ವಿಷ್ಣೋರುರಸಿ ಸ್ಥಿತಾಯೈ |\n" +
                "ನಮೋ\uFEFF\u200Cஉಸ್ತು ಲಕ್ಷ್ಮ್ಯೈ ಕಮಲಾಲಯಾಯೈ\n" +
                "ನಮೋ\uFEFF\u200Cஉಸ್ತು ದಾಮೋದರ ವಲ್ಲಭಾಯೈ || 14 ||\n" +
                "ನಮೋ\uFEFF\u200Cஉಸ್ತು ಕಾಂತ್ಯೈ ಕಮಲೇಕ್ಷಣಾಯೈ\n" +
                "ನಮೋ\uFEFF\u200Cஉಸ್ತು ಭೂತ್ಯೈ ಭುವನಪ್ರಸೂತ್ಯೈ |\n" +
                "ನಮೋ\uFEFF\u200Cஉಸ್ತು ದೇವಾದಿಭಿರರ್ಚಿತಾಯೈ\n" +
                "ನಮೋ\uFEFF\u200Cஉಸ್ತು ನಂದಾತ್ಮಜ ವಲ್ಲಭಾಯೈ || 15 ||\n" +
                "ಸಂಪತ್ಕರಾಣಿ ಸಕಲೇಂದ್ರಿಯ ನಂದನಾನಿ \n" +
                "ಸಾಮ್ರಾಜ್ಯ ದಾನವಿಭವಾನಿ ಸರೋರುಹಾಕ್ಷಿ |\n" +
                "ತ್ವದ್ವಂದನಾನಿ ದುರಿತಾ ಹರಣೋದ್ಯತಾನಿ \n" +
                "ಮಾಮೇವ ಮಾತರನಿಶಂ ಕಲಯಂತು ಮಾನ್ಯೇ || 16 ||\n" +
                "ಯತ್ಕಟಾಕ್ಷ ಸಮುಪಾಸನಾ ವಿಧಿಃ \n" +
                "ಸೇವಕಸ್ಯ ಸಕಲಾರ್ಥ ಸಂಪದಃ |\n" +
                "ಸಂತನೋತಿ ವಚನಾಂಗ ಮಾನಸೈಃ \n" +
                "ತ್ವಾಂ ಮುರಾರಿಹೃದಯೇಶ್ವರೀಂ ಭಜೇ || 17 ||\n" +
                "ಸರಸಿಜನಿಲಯೇ ಸರೋಜಹಸ್ತೇ \n" +
                "ಧವಳತಮಾಂಶುಕ ಗಂಧಮಾಲ್ಯಶೋಭೇ |\n" +
                "ಭಗವತಿ ಹರಿವಲ್ಲಭೇ ಮನೋಙ್ಞೇ\n" +
                "ತ್ರಿಭುವನಭೂತಿಕರೀ ಪ್ರಸೀದಮಹ್ಯಮ್ || 18 ||\n" +
                "ದಿಗ್ಘಸ್ತಿಭಿಃ ಕನಕ ಕುಂಭಮುಖಾವಸೃಷ್ಟ \n" +
                "ಸ್ವರ್ವಾಹಿನೀ ವಿಮಲಚಾರುಜಲಾಪ್ಲುತಾಂಗೀಮ್ |\n" +
                "ಪ್ರಾತರ್ನಮಾಮಿ ಜಗತಾಂ ಜನನೀಮಶೇಷ \n" +
                "ಲೋಕಧಿನಾಥ ಗೃಹಿಣೀಮಮೃತಾಬ್ಧಿಪುತ್ರೀಮ್ || 19 ||\n" +
                "ಕಮಲೇ ಕಮಲಾಕ್ಷ ವಲ್ಲಭೇ ತ್ವಂ \n" +
                "ಕರುಣಾಪೂರ ತರಂಗಿತೈರಪಾಂಗೈಃ |\n" +
                "ಅವಲೋಕಯ ಮಾಮಕಿಂಚನಾನಾಂ \n" +
                "ಪ್ರಥಮಂ ಪಾತ್ರಮಕೃತಿಮಂ ದಯಾಯಾಃ || 20 ||\n" +
                "ದೇವಿ ಪ್ರಸೀದ ಜಗದೀಶ್ವರಿ ಲೋಕಮಾತಃ\n" +
                "ಕಳ್ಯಾಣಗಾತ್ರಿ ಕಮಲೇಕ್ಷಣ ಜೀವನಾಥೇ |\n" +
                "ದಾರಿದ್ರ್ಯಭೀತಿಹೃದಯಂ ಶರಣಾಗತಂ ಮಾಂ\n" +
                "ಆಲೋಕಯ ಪ್ರತಿದಿನಂ ಸದಯೈರಪಾಂಗೈಃ || 21 ||\n" +
                "ಸ್ತುವಂತಿ ಯೇ ಸ್ತುತಿಭಿರಮೀಭಿರನ್ವಹಂ \n" +
                "ತ್ರಯೀಮಯೀಂ ತ್ರಿಭುವನಮಾತರಂ ರಮಾಮ್ |\n" +
                "ಗುಣಾಧಿಕಾ ಗುರುತುರ ಭಾಗ್ಯ ಭಾಗಿನಃ\n" +
                "ಭವಂತಿ ತೇ ಭುವಿ ಬುಧ ಭಾವಿತಾಶಯಾಃ || 22 ||\n" +
                "ಸುವರ್ಣಧಾರಾ ಸ್ತೋತ್ರಂ ಯಚ್ಛಂಕರಾಚಾರ್ಯ ನಿರ್ಮಿತಂ \n" +
                "ತ್ರಿಸಂಧ್ಯಂ ಯಃ ಪಠೇನ್ನಿತ್ಯಂ ಸ ಕುಬೇರಸಮೋ ಭವೇತ್ ||");
    }
}
